{
  "sun": {
    "signs": {
      "aries": "الشمس في الحمل (البيت الأول الطبيعي): تعني شجاعة، مبادرة، قيادة ذاتية، وطاقة عالية. الشخصية تكون واثقة ومندفعة.",
      "taurus": "الشمس في الثور: تركيز على الاستقرار المادي، حب الراحة والجمال، وعناد في القرارات. تقدير كبير للممتلكات.",
      "gemini": "الشمس في الجوزاء: شخصية فضولية، ذكية، سريعة التكيف، ومحبة للتواصل والتعلم. اهتمام دائم بالمعلومات.",
      "cancer": "الشمس في السرطان: تعني شخصية عاطفية، تهتم بالأسرة والمنزل والجذور. حساسية وحاجة للأمان العاطفي.",
      "leo": "الشمس في الأسد (حكمها): قيادة طبيعية، حب للظهور، ثقة كبيرة، وشخصية كريمة ومسرحية.",
      "virgo": "الشمس في العذراء: شخصية منظمة، تحليلية، تهتم بالتفاصيل، وتهدف لخدمة الآخرين وتحسين الذات.",
      "libra": "الشمس في الميزان: تعني شخصية تبحث عن التوازن والعدالة والسلام. تحتاج إلى الشراكة والانسجام في الحياة.",
      "scorpio": "الشمس في العقرب: تعني قوة إرادة، عمق عاطفي، شغف، ميل للتحقيق والأسرار. شخصية شديدة التحفظ والقوة.",
      "sagittarius": "الشمس في القوس: حب السفر، الفلسفة، الحكمة، والتعليم العالي. شخصية متفائلة ومحبة للحرية.",
      "capricorn": "الشمس في الجدي: طموح مهني كبير، انضباط، تركيز على المسؤولية والبنية، والسعي لتحقيق المكانة.",
      "aquarius": "الشمس في الدلو: تعني شخصية إنسانية، مبتكرة، تهتم بالمجموعات والأفكار المستقبلية. غالباً ما تكون غير تقليدية.",
      "pisces": "الشمس في الحوت: تعني حساسية، تعاطف، خيال واسع، وميول روحانية أو فنية. شخصية تهرب من الواقع أحياناً."
    },
    "houses": {
      "1": "الشمس في البيت الأول: هوية قوية، حضور لافت، ثقة بالنفس، ومصير مرتبط بالذات والبدايات.",
      "2": "الشمس في البيت الثاني: تركيز أساسي على المال، الموارد، والقيمة الذاتية. مصدر دخلك هو جزء من هويتك.",
      "3": "الشمس في البيت الثالث: القوة في التواصل، الذكاء، القدرة على التعلم السريع، والاهتمام بالأشقاء والجوار.",
      "4": "الشمس في البيت الرابع: الهوية مرتبطة بالمنزل، العائلة، الجذور، والتراث. أحد الوالدين كان شخصية محورية.",
      "5": "الشمس في البيت الخامس: التعبير الذاتي، الإبداع، الحب، والأطفال. ميل للمخاطرة والمرح.",
      "6": "الشمس في البيت السادس: التركيز على العمل اليومي، الصحة، الخدمة، والتفاصيل. الفخر يأتي من الإتقان.",
      "7": "الشمس في البيت السابع: البحث عن شريك قوي ومشهور. هويتك تكتمل من خلال العلاقة الزوجية أو الشراكات.",
      "8": "الشمس في البيت الثامن: اهتمام عميق بالأسرار، الموارد المشتركة، التحول، والميتافيزيقيا. قوة في الأزمات.",
      "9": "الشمس في البيت التاسع: حب السفر، الفلسفة، المعتقدات، والتعليم العالي. سعي دائم للحقيقة والمعنى.",
      "10": "الشمس في البيت العاشر (الوسط الطبيعي): طموح مهني، سعي للسلطة والشهرة، والنجاح العام. مكانة مهمة في المجتمع.",
      "11": "الشمس في البيت الحادي عشر: قيادة ضمن المجموعات، الاهتمامات الإنسانية، والأهداف المستقبلية. الأصدقاء مهمون جداً.",
      "12": "الشمس في البيت الثاني عشر: اهتمام بالعزلة، التأمل، الخدمة الخفية، وقضاء الوقت في الخفاء. القوة الكامنة أو المكتومة."
    }
  },
  "moon": {
    "signs": {
      "aries": "القمر في الحمل: استجابة عاطفية سريعة ومندفعة. المشاعر تتطلب الحرية والاستقلالية. مزاج متقلب قليلاً.",
      "taurus": "القمر في الثور (علو): احتياجات عاطفية ثابتة ومريحة. تجد الأمان في الماديات والألفة. هدوء واستقرار عاطفي.",
      "gemini": "القمر في الجوزاء: الحاجة إلى التحفيز الذهني والتنوع العاطفي. تبحث عن الأمان من خلال التواصل والكلمات.",
      "cancer": "القمر في السرطان (حكمه): ارتباط عميق بالمنزل والعائلة. حساسية مفرطة وقدرة على رعاية الآخرين.",
      "leo": "القمر في الأسد: الحاجة إلى الاعتراف والتقدير العاطفي. مشاعر درامية، وكريمة تجاه من تحب.",
      "virgo": "القمر في العذراء: المشاعر منظمة ومحللة. تجد الأمان في الروتين والخدمة. قلق بشأن التفاصيل.",
      "libra": "القمر في الميزان: الحاجة إلى الانسجام والتوازن في العلاقات. الاستقرار العاطفي مرتبط بالشراكة.",
      "scorpio": "القمر في العقرب (وبال): مشاعر عميقة، شديدة، ومتحفظة. تخاف من الضعف العاطفي وتفضل التحكم.",
      "sagittarius": "القمر في القوس: الحاجة إلى التفاؤل والحرية والمغامرة. تسعى للمعنى في تجاربك العاطفية.",
      "capricorn": "القمر في الجدي: مشاعر مكبوتة ومتحفظة. تجد الأمان في الإنجاز والمسؤولية والمكانة الاجتماعية.",
      "aquarius": "القمر في الدلو: استجابات عاطفية منفصلة قليلاً أو موضوعية. تجد الأمان في الأفكار والمجموعات الإنسانية.",
      "pisces": "القمر في الحوت: حساسية فائقة وتعاطف. مشاعر تتأثر بالبيئة، وتجد الأمان في الهروب أو الخيال."
    },
    "houses": {
      "1": "القمر في البيت الأول: حساسية وعفوية في التعبير عن الذات. الشخصية متغيرة وتتأثر بالمزاج والبيئة.",
      "2": "القمر في البيت الثاني: التقلب في الشؤون المالية أو مصادر الدخل. الأمان العاطفي مرتبط بالمال والممتلكات.",
      "3": "القمر في البيت الثالث: الحاجة إلى التواصل والتعبير عن المشاعر. علاقة قوية مع الأشقاء أو الجيران.",
      "4": "القمر في البيت الرابع (حكمه الطبيعي): تعلق عميق بالمنزل والجذور والأم. الحاجة الماسة للأمان المنزلي.",
      "5": "القمر في البيت الخامس: تقلب عاطفي في علاقات الحب. الحاجة العاطفية للإبداع والأطفال والمرح.",
      "6": "القمر في البيت السادس: الحاجة العاطفية للعمل والروتين. القلق بشأن الصحة أو الخدمة اليومية.",
      "7": "القمر في البيت السابع: احتياج قوي للعلاقات والشراكات. الشريك يمثل مصدر الأمان العاطفي أو يسبب التقلب.",
      "8": "القمر في البيت الثامن: مشاعر عميقة ومتحفظة تجاه الموارد المشتركة والتحول. تقلبات عاطفية قوية.",
      "9": "القمر في البيت التاسع: الحاجة العاطفية لاستكشاف الفلسفات والسفر والتعليم. مشاعر واسعة الأفق.",
      "10": "القمر في البيت العاشر: تقلب في المسار المهني. المسار المهني مرتبط بالرعاية العامة أو الجمهور أو الأم.",
      "11": "القمر في البيت الحادي عشر: البحث عن الأمان العاطفي ضمن مجموعة من الأصدقاء. مشاعر مرتبطة بالآمال والأمنيات.",
      "12": "القمر في البيت الثاني عشر: مشاعر خفية وعمق عاطفي. الحاجة إلى العزلة أو التأمل. مشاعر تتأثر باللاوعي."
    }
  },
  "mercury": {
    "signs": {
      "aries": "عطارد في الحمل: تفكير سريع ومندفع. قدرة على بدء الأفكار لكن مع قلة في الصبر على التفاصيل.",
      "taurus": "عطارد في الثور: تفكير عملي وبطيء وثابت. طريقة تعلم مرتبطة بالحواس والخبرة المادية.",
      "gemini": "عطارد في الجوزاء (حكمه): ذكاء سريع، فضول، مهارات تواصل عالية وقدرة على تعدد المهام.",
      "cancer": "عطارد في السرطان: تفكير عاطفي وموجه بالحدس والذاكرة. التعبير يكون شخصياً ومحباً.",
      "leo": "عطارد في الأسد: التعبير درامي وواثق. يحب أن يكون مركز الانتباه في الحديث ونشر أفكاره.",
      "virgo": "عطارد في العذراء (حكمه وعلو): تفكير تحليلي ومنظم للغاية. مهارات ممتازة في البحث والتحسين.",
      "libra": "عطارد في الميزان: تفكير مرتبط بالإنصاف، الدبلوماسية، ووجهة نظر الآخرين. يزن الخيارات قبل اتخاذ القرار.",
      "scorpio": "عطارد في العقرب: تفكير عميق، تحليلي، وباحث عن الأسرار والحقائق المخفية. لديه مهارات استقصائية.",
      "sagittarius": "عطارد في القوس: تفكير فلسفي، واسع الأفق، ومهتم بالصورة الكبيرة على حساب التفاصيل الصغيرة.",
      "capricorn": "عطارد في الجدي: تفكير منظم، عملي، وهادئ. مهارات تخطيط طويلة المدى والجدية في التعبير.",
      "aquarius": "عطارد في الدلو: تفكير مبتكر، غير تقليدي، وإنساني. يهتم بالأفكار الجماعية والمستقبلية.",
      "pisces": "عطارد في الحوت (هبوط): تفكير حدسي، خيالي، وغير تقليدي. صعوبة في التركيز على التفاصيل المادية أو المنطق البحت."
    },
    "houses": {
      "1": "عطارد في البيت الأول: شخصية فضولية، محبة للتعبير والتواصل، وذكية. كلامك يشكل جزءاً كبيراً من هويتك.",
      "2": "عطارد في البيت الثاني: التفكير والتخطيط مرتبط بكيفية كسب المال وإدارة الموارد. قد يكون هناك عدة مصادر دخل.",
      "3": "عطارد في البيت الثالث (حكمه الطبيعي): قدرة ممتازة على التواصل، الكتابة، التعلم، والتعامل مع الأشقاء والبيئة المباشرة.",
      "4": "عطارد في البيت الرابع: كثرة التفكير في المنزل والعائلة. الحركة والنشاط الذهني في محيطك الخاص.",
      "5": "عطارد في البيت الخامس: ذكاء في الإبداع، التخطيط للمرح، والتعامل مع الأطفال. يمكن أن يكون شخصاً مرحاً وذكياً.",
      "6": "عطارد في البيت السادس: التركيز على تفاصيل العمل اليومي، التنظيم، والصحة. يحتاج إلى روتين عقلي منظم.",
      "7": "عطارد في البيت السابع: البحث عن شريك محاور أو مفكر. العلاقات والشراكات تبنى على التواصل الفكري.",
      "8": "عطارد في البيت الثامن: تفكير عميق وتحليلي في الموارد المشتركة، الأسرار، والموت. مهارات في التحقيق.",
      "9": "عطارد في البيت التاسع: دراسة الفلسفات، السفر لأجل المعرفة، والتعلم المستمر في المواضيع البعيدة.",
      "10": "عطارد في البيت العاشر: المسار المهني يتضمن التواصل، الكتابة، التدريس، أو التجارة. ذكاء في العمل.",
      "11": "عطارد في البيت الحادي عشر: التواصل النشط مع المجموعات والأصدقاء. التفكير في الأهداف الإنسانية والمستقبلية.",
      "12": "عطارد في البيت الثاني عشر: تفكير سري أو حدسي. العقل يعمل في العزلة أو يهتم بالمواضيع الروحانية والخفية."
    }
  },
  "venus": {
    "signs": {
      "aries": "الزهرة في الحمل: حب مندفع وعفوي. تنجذب للجرأة والمغامرة في العلاقات. قد تكون سريعة الملل.",
      "taurus": "الزهرة في الثور (حكمها): حب ثابت، حسي، وممتع. تقدير كبير للجمال المادي والرفاهية والراحة.",
      "gemini": "الزهرة في الجوزاء: حب خفيف وذهني. تجد الجاذبية في الذكاء والمرح والتنوع في العلاقات.",
      "cancer": "الزهرة في السرطان: حب عاطفي، رعاية، وتعلق بالأسرة والمنزل. تبحث عن الألفة في الشريك.",
      "leo": "الزهرة في الأسد: حب درامي، كريم، ومبهر. تحتاج إلى التقدير والإعجاب في علاقاتها.",
      "virgo": "الزهرة في العذراء (هبوط): طريقة دقيقة وعملية في إظهار الحب. تخدم من تحب وقد تكون شديدة النقد.",
      "libra": "الزهرة في الميزان (حكمها وعلو): حب متوازن ودبلوماسي. تقدر الجمال والعدالة والانسجام في كل شيء.",
      "scorpio": "الزهرة في العقرب: حب عميق، شغوف، ومليء بالتحولات. تحتاج إلى العمق العاطفي وقد تكون غيورة.",
      "sagittarius": "الزهرة في القوس: حب مغامر، متفائل، ومحفز فكرياً. تقدر الحرية في العلاقة وتبتعد عن القيود.",
      "capricorn": "الزهرة في الجدي: حب جدي، مسؤول، ويهدف إلى الاستقرار طويل المدى. الحاجة إلى الاحترام والمكانة في العلاقة.",
      "aquarius": "الزهرة في الدلو: حب غير تقليدي، صداقة أولاً، وتقدير للحرية الشخصية في العلاقة. علاقات عابرة للحدود.",
      "pisces": "الزهرة في الحوت (علو): حب مثالي، تعاطفي، وتضحية. تتشابك مشاعرها مع الشريك وتبحث عن الرومانسية المطلقة."
    },
    "houses": {
      "1": "الزهرة في البيت الأول: شخصية جذابة، دبلوماسية، ومحبة للجمال والانسجام. مظهر خارجي أنيق.",
      "2": "الزهرة في البيت الثاني (حكمها الطبيعي): سهولة في كسب المال، حب الرفاهية، وممتلكات جميلة. المال مصدر راحة.",
      "3": "الزهرة في البيت الثالث: علاقات متناغمة مع الأشقاء، التعبير اللطيف، وحب الفنون والتواصل.",
      "4": "الزهرة في البيت الرابع: منزل جميل ومريح. علاقات متناغمة مع العائلة. الأمان العاطفي مرتبط بالمنزل.",
      "5": "الزهرة في البيت الخامس: حب الإبداع، المتعة، الأطفال، والرومانسية. حظ في المضاربات والحب.",
      "6": "الزهرة في البيت السادس: علاقات متناغمة في العمل. حب مساعدة الآخرين أو تجميل بيئة العمل.",
      "7": "الزهرة في البيت السابع (حكمها الطبيعي): حظ في الزواج والشراكات. البحث عن شريك جذاب ودبلوماسي.",
      "8": "الزهرة في البيت الثامن: علاقات شغوفة، اهتمام بالموارد المشتركة، وقد تكون هناك مكاسب من الشريك.",
      "9": "الزهرة في البيت التاسع: حب السفر، الثقافة الأجنبية، والفلسفات الجميلة. علاقات مع أجانب أو في الدراسة العليا.",
      "10": "الزهرة في البيت العاشر: مهنة مرتبطة بالفنون، الجمال، الأزياء، أو الدبلوماسية. شعبية وجاذبية في العمل.",
      "11": "الزهرة في البيت الحادي عشر: علاقات جيدة مع الأصدقاء. الأصدقاء مصدر للمكاسب. محبة للتجمعات الاجتماعية.",
      "12": "الزهرة في البيت الثاني عشر: علاقات عاطفية سرية أو روحانية. تضحية في الحب أو اهتمام بالفن في العزلة."
    }
  },
  "mars": {
    "signs": {
      "aries": "المريخ في الحمل (حكمه): طاقة هائلة، مبادرة، وشجاعة. ميل للغضب والاندفاعية في التصرفات.",
      "taurus": "المريخ في الثور: طاقة ثابتة وموجهة نحو كسب المال والممتلكات. عناد في تطبيق الأفعال.",
      "gemini": "المريخ في الجوزاء: طاقة موجهة نحو التواصل والكلام والجدال. ذكاء في الحركة والعمل اليدوي.",
      "cancer": "المريخ في السرطان (هبوط): طاقة موجهة نحو حماية العائلة والمنزل. الغضب قد يكون مكبوتاً أو يظهر كحساسية.",
      "leo": "المريخ في الأسد: طاقة درامية، موجهة نحو الإبداع واللعب والظهور. قيادة قوية للأطفال أو المشاريع.",
      "virgo": "المريخ في العذراء: طاقة دقيقة وموجهة نحو العمل اليومي والتحليل. غضب على عدم الكمال أو النظام.",
      "libra": "المريخ في الميزان: طاقة موجهة نحو تحقيق العدالة في العلاقات. قد يسبب التردد أو الخلافات في الشراكة.",
      "scorpio": "المريخ في العقرب (حكمه): طاقة عميقة، شغوفة، وموجهة نحو التحول والتحقيق. قوة إرادة هائلة وتحفظ.",
      "sagittarius": "المريخ في القوس: طاقة موجهة نحو المعتقدات، السفر، والفلسفة. ميل للجدل حول الأفكار.",
      "capricorn": "المريخ في الجدي (علو): طاقة منظمة، طموحة، وموجهة نحو الأهداف المهنية. إنجاز وتحمل مسؤولية.",
      "aquarius": "المريخ في الدلو: طاقة موجهة نحو الأهداف الجماعية والابتكار والتكنولوجيا. الغضب يكون فكرياً أو غير تقليدي.",
      "pisces": "المريخ في الحوت: طاقة غير مباشرة، حدسية، وموجهة نحو الفن أو الروحانيات. صعوبة في توجيه الفعل بشكل مادي واضح."
    },
    "houses": {
      "1": "المريخ في البيت الأول (حكمه الطبيعي): طاقة حيوية وقوة بدنية. ميل للاندفاع والغضب السريع. شخصية رياضية أو حركية.",
      "2": "المريخ في البيت الثاني: طاقة موجهة نحو كسب المال. قد يسبب خلافات مالية أو صرفاً سريعاً للمال.",
      "3": "المريخ في البيت الثالث: طاقة في التواصل والجدال. قد يسبب خلافات مع الأشقاء أو الجوار. نشاط في السفر القصير.",
      "4": "المريخ في البيت الرابع: خلافات أو توتر في المنزل ومع العائلة. طاقة موجهة نحو بناء أو إصلاح المنزل.",
      "5": "المريخ في البيت الخامس: طاقة قوية في الإبداع والحب والمضاربات. علاقات حب مليئة بالشغف أو الخلافات.",
      "6": "المريخ في البيت السادس: طاقة في العمل اليومي. كفاءة في مواجهة الأعداء والأمراض. شخصية مجتهدة.",
      "7": "المريخ في البيت السابع: خلافات أو صراعات مع الشريك أو في الشراكات. طاقة موجهة نحو التحدي في العلاقات.",
      "8": "المريخ في البيت الثامن: طاقة موجهة نحو الأسرار، التحقيق، والموارد المشتركة. شغف عميق وتحول.",
      "9": "المريخ في البيت التاسع: طاقة موجهة نحو المعتقدات والسفر والفلسفة. ميل للجدل حول المعرفة.",
      "10": "المريخ في البيت العاشر: طاقة قوية وطموح في المسار المهني. قيادة وإنجاز سريع. قد يسبب خلافات مع السلطة.",
      "11": "المريخ في البيت الحادي عشر: طاقة موجهة نحو الأصدقاء والمجموعات. ميل للقيادة أو التحدي في الأهداف الجماعية.",
      "12": "المريخ في البيت الثاني عشر: طاقة مكبوتة أو سرية. قد يسبب العداء السري أو العمل في الخفاء أو التضحية."
    }
  },
  "jupiter": {
    "signs": {
      "aries": "المشتري في الحمل: تفاؤل وفلسفة في بدايات جديدة. توسع في الذات والمبادرة.",
      "taurus": "المشتري في الثور: توسع في الثروة والممتلكات. سخاء وحب للرفاهية المادية.",
      "gemini": "المشتري في الجوزاء: توسع في المعرفة والتواصل والأسفار القصيرة. عقل واسع الفضول.",
      "cancer": "المشتري في السرطان (علو): توسع في الأسرة، المنزل، والرعاية. سخاء عاطفي وحدسي.",
      "leo": "المشتري في الأسد: توسع في الإبداع، القيادة، والمرح. سخاء في التعبير الذاتي والاهتمام.",
      "virgo": "المشتري في العذراء: توسع في مجال العمل اليومي، التنظيم، والخدمة. حكمة في التفاصيل.",
      "libra": "المشتري في الميزان: توسع في الشراكات، العلاقات، والعدالة. حكمة في الدبلوماسية.",
      "scorpio": "المشتري في العقرب: توسع في الموارد المشتركة، الأسرار، والتحول. حكمة في الشغف والعمق.",
      "sagittarius": "المشتري في القوس (حكمه): توسع في الفلسفة، السفر، والمعتقدات. حكمة كبيرة وتفاؤل.",
      "capricorn": "المشتري في الجدي (هبوط): توسع محدود بالمسؤولية أو العمل الشاق. حكمة عملية ومنظمة.",
      "aquarius": "المشتري في الدلو: توسع في الأهداف الجماعية، الأصدقاء، والأفكار المستقبلية. حكمة إنسانية.",
      "pisces": "المشتري في الحوت (حكمه): توسع في الروحانية، التعاطف، والفنون. حكمة حدسية وتضحية."
    },
    "houses": {
      "1": "المشتري في البيت الأول: شخصية متفائلة، سخية، ومحبة للحكمة. حظ وتوسع في فرص الحياة الشخصية.",
      "2": "المشتري في البيت الثاني: حظ في المال، وفرص لكسب الثروة. سخاء في الإنفاق أو الاستثمار.",
      "3": "المشتري في البيت الثالث: حظ وتوسع في التواصل والتعلم. علاقات جيدة مع الأشقاء والمحيط القريب.",
      "4": "المشتري في البيت الرابع: حظ وسعادة في المنزل والعائلة. توسع في الممتلكات العقارية.",
      "5": "المشتري في البيت الخامس: حظ في الإبداع، الحب، والأطفال. فرص كبيرة للمرح والمضاربة.",
      "6": "المشتري في البيت السادس: حظ وحماية في مجال العمل اليومي والصحة. توسع في فرص العمل.",
      "7": "المشتري في البيت السابع: حظ في الزواج والشراكات. شريك حكيم وكريم أو غني.",
      "8": "المشتري في البيت الثامن: حظ في الموارد المشتركة (ميراث، قروض). حكمة في الشغف والتحول.",
      "9": "المشتري في البيت التاسع (حكمه الطبيعي): حظ في السفر والتعليم العالي والفلسفة. توسع في المعتقدات.",
      "10": "المشتري في البيت العاشر: حظ ونجاح في المسار المهني. توسع في المكانة الاجتماعية والشهرة.",
      "11": "المشتري في البيت الحادي عشر: حظ كبير من الأصدقاء والمجموعات. تحقيق الآمال والأمنيات.",
      "12": "المشتري في البيت الثاني عشر: حظ وحماية في الخفاء. توسع في الروحانية والتأمل والخدمة السرية."
    }
  },
  "saturn": {
    "signs": {
      "aries": "زحل في الحمل (هبوط): صعوبة في المبادرة والاندفاع. دروس عن الصبر وبناء الهوية ببطء.",
      "taurus": "زحل في الثور: مسؤولية وجدية تجاه المال والموارد. بناء ثروة ببطء وثبات.",
      "gemini": "زحل في الجوزاء: انضباط في التواصل والتعلم. التفكير العملي والمنطقي في الأفكار.",
      "cancer": "زحل في السرطان: مسؤولية ثقيلة تجاه العائلة أو المنزل. دروس في الأمان العاطفي.",
      "leo": "زحل في الأسد: صعوبة في التعبير الذاتي أو الإبداع. دروس في المسؤولية القيادية.",
      "virgo": "زحل في العذراء: انضباط في العمل اليومي والتنظيم. جدية تجاه الصحة والخدمة.",
      "libra": "زحل في الميزان (علو): انضباط ومسؤولية في الشراكات والعلاقات. الالتزام بالعدالة والإنصاف.",
      "scorpio": "زحل في العقرب: مسؤولية تجاه الأسرار والموارد المشتركة. جدية وعمق في التحول الشخصي.",
      "sagittarius": "زحل في القوس: مسؤولية تجاه الفلسفات والتعليم العالي. بناء نظام معتقدات صلب.",
      "capricorn": "زحل في الجدي (حكمه): انضباط شديد، طموح، وقدرة على بناء الهياكل المهنية والاجتماعية.",
      "aquarius": "زحل في الدلو (حكمه): مسؤولية تجاه الأهداف الجماعية والأصدقاء. بناء مجموعات أو شبكات منظمة.",
      "pisces": "زحل في الحوت: مسؤولية تجاه الروحانية والعزلة. دروس في وضع حدود عاطفية والتضحية المنضبطة."
    },
    "houses": {
      "1": "زحل في البيت الأول: تأخير في النضج أو الشعور بالمسؤولية تجاه الذات. شخصية جدية ومتحفظة.",
      "2": "زحل في البيت الثاني: صعوبات أو تأخير في كسب المال. الحاجة إلى العمل الجاد لبناء الثروة.",
      "3": "زحل في البيت الثالث: صعوبة أو جدية في التواصل. مسؤولية تجاه الأشقاء أو المحيط القريب.",
      "4": "زحل في البيت الرابع: صعوبات عائلية أو منزل غير مريح. مسؤولية تجاه أحد الوالدين أو الجذور.",
      "5": "زحل في البيت الخامس: مسؤولية تجاه الأطفال أو الإبداع. صعوبة أو تأخير في الحب أو المرح.",
      "6": "زحل في البيت السادس: مسؤولية تجاه العمل اليومي والخدمة. الانضباط في الصحة والروتين.",
      "7": "زحل في البيت السابع: تأخير أو صعوبة في الزواج. شريك جدي أو أكبر سناً. مسؤولية في الشراكة.",
      "8": "زحل في البيت الثامن: مسؤولية تجاه موارد الآخرين أو الديون. دروس في التحرر من المخاوف والتحول.",
      "9": "زحل في البيت التاسع: تأخير أو تحديات في التعليم العالي أو السفر. بناء فلسفة حياة عملية.",
      "10": "زحل في البيت العاشر (حكمه الطبيعي): تأخير في النجاح المهني يتبعه ثبات. بناء مكانة اجتماعية قوية.",
      "11": "زحل في البيت الحادي عشر: عدد محدود من الأصدقاء الموثوق بهم. بناء أهداف مستقبلية بجدية.",
      "12": "زحل في البيت الثاني عشر: الشعور بالوحدة أو العزلة. مسؤولية تجاه الخدمة السرية أو الروحانية."
    }
  },
  "uranus": {
    "signs": {
      "aries": "أورانوس في الحمل: ثورة في مجال الذات والهوية. جيل يبحث عن الحرية والتحرر الشخصي بشكل مفاجئ.",
      "taurus": "أورانوس في الثور: ثورة في المال والموارد. جيل يبحث عن طرق غير تقليدية لكسب الثروة.",
      "gemini": "أورانوس في الجوزاء: ثورة في التواصل والأفكار. جيل يتبنى تقنيات غير تقليدية في التعلم.",
      "cancer": "أورانوس في السرطان: ثورة في مفهوم الأسرة والمنزل. جيل يتمرد على الجذور والتقاليد العائلية.",
      "leo": "أورانوس في الأسد: ثورة في التعبير والإبداع. جيل مبتكر في مجال الترفيه أو القيادة.",
      "virgo": "أورانوس في العذراء: ثورة في العمل والروتين. جيل يستخدم التكنولوجيا لتغيير طرق العمل والخدمة.",
      "libra": "أورانوس في الميزان: ثورة في العلاقات والشراكات. جيل يتبنى مفاهيم زواج غير تقليدية.",
      "scorpio": "أورانوس في العقرب: ثورة في التحول والموارد المشتركة. جيل يبحث عن تغييرات جذرية في النظام المالي.",
      "sagittarius": "أورانوس في القوس: ثورة في الفلسفة والمعتقدات. جيل يبحث عن معارف خارجة عن المألوف.",
      "capricorn": "أورانوس في الجدي: ثورة في الهياكل والسلطة. جيل يتمرد على القوانين والمؤسسات القديمة.",
      "aquarius": "أورانوس في الدلو (حكمه): ثورة في الأهداف والمجموعات. جيل يركز على الابتكار والتكنولوجيا والإنسانية.",
      "pisces": "أورانوس في الحوت: ثورة في الروحانية واللاوعي. جيل يبحث عن يقظة روحية غير تقليدية."
    },
    "houses": {
      "1": "أورانوس في البيت الأول: شخصية غير تقليدية، عصبية، ومتمردة. التعبير عن الذات يكون صادماً ومبتكراً.",
      "2": "أورانوس في البيت الثاني: تقلب ومفاجآت في الشؤون المالية. كسب المال بطرق غير عادية أو من التكنولوجيا.",
      "3": "أورانوس في البيت الثالث: تفكير مفاجئ وخارج عن الصندوق. علاقات غير تقليدية مع الأشقاء أو الجوار.",
      "4": "أورانوس في البيت الرابع: تغيير مفاجئ في المنزل أو مكان الإقامة. علاقة غير تقليدية مع الأسرة.",
      "5": "أورانوس في البيت الخامس: إبداع مبتكر وغير تقليدي. علاقات حب مفاجئة أو غير مستقرة. حب المخاطرة.",
      "6": "أورانوس في البيت السادس: عمل غير تقليدي أو مرتبط بالتكنولوجيا. تقلب في الروتين. صحة تتأثر بالتوتر.",
      "7": "أورانوس في البيت السابع: زواج وشراكات غير تقليدية أو مفاجئة. الشريك يكون فريداً أو غريباً.",
      "8": "أورانوس في البيت الثامن: تجارب مفاجئة في التحول. كشف للأسرار. تقلب في الموارد المشتركة.",
      "9": "أورانوس في البيت التاسع: سفر مفاجئ. الاهتمام بالفلسفات المبتكرة والعلوم الحديثة.",
      "10": "أورانوس في البيت العاشر: مسار مهني غير تقليدي ومبتكر. تغيير مفاجئ في المهنة أو الهدف العام.",
      "11": "أورانوس في البيت الحادي عشر (حكمه الطبيعي): أصدقاء غير تقليديين. الابتكار في الأهداف الجماعية والمستقبلية.",
      "12": "أورانوس في البيت الثاني عشر: يقظة روحية مفاجئة. العمل في الخفاء بطرق مبتكرة أو عصبية مكبوتة."
    }
  },
  "neptune": {
    "signs": {
      "aries": "نبتون في الحمل: جيل يحمل رؤى وأحلاماً ضبابية حول مفهوم القيادة والذات. ضياع في الهوية.",
      "taurus": "نبتون في الثور: جيل يحمل رؤى مثالية حول المال والقيمة المادية. تضخيم في الحاجة إلى الرفاهية.",
      "gemini": "نبتون في الجوزاء: جيل يحمل رؤى مثالية حول التواصل والمعرفة. ضبابية أو خداع في المعلومات.",
      "cancer": "نبتون في السرطان: جيل يحمل رؤى مثالية حول الأسرة والجذور. تعاطف مفرط مع الماضي العائلي.",
      "leo": "نبتون في الأسد: جيل يحمل رؤى مثالية حول الإبداع والترفيه. إلهام فني أو تضخيم في الأنا.",
      "virgo": "نبتون في العذراء (وبال): جيل يحمل رؤى مثالية حول الخدمة والعمل اليومي. ضبابية في الروتين أو الصحة.",
      "libra": "نبتون في الميزان: جيل يحمل رؤى مثالية حول الشراكة والعدالة. صعوبة في رؤية الشريك بوضوح.",
      "scorpio": "نبتون في العقرب: جيل يحمل رؤى مثالية حول الأسرار والتحول. ضبابية في الشغف والعمق العاطفي.",
      "sagittarius": "نبتون في القوس: جيل يحمل رؤى مثالية حول الفلسفة والبحث عن المعنى. ضبابية في المعتقدات.",
      "capricorn": "نبتون في الجدي: جيل يحمل رؤى مثالية حول الهياكل الاجتماعية والسلطة. إحباط في المؤسسات.",
      "aquarius": "نبتون في الدلو: جيل يحمل رؤى مثالية حول الأهداف الإنسانية والاجتماعية. تعاطف مع المجموعات.",
      "pisces": "نبتون في الحوت (حكمه): جيل يحمل رؤى مثالية حول الروحانية، الفن، والتعاطف. إلهام وتضحية."
    },
    "houses": {
      "1": "نبتون في البيت الأول: شخصية حالمة، غامضة، وحساسة للغاية. قد يجد صعوبة في وضع الحدود الشخصية.",
      "2": "نبتون في البيت الثاني: ضبابية وعدم وضوح في الشؤون المالية. كسب المال بطرق غير مباشرة أو فنية.",
      "3": "نبتون في البيت الثالث: تفكير خيالي وحدسي. ضبابية في التواصل أو في العلاقة مع الأشقاء.",
      "4": "نبتون في البيت الرابع: ضبابية في البيئة المنزلية أو الأجواء العائلية. ميل للهروب أو العزلة في المنزل.",
      "5": "نبتون في البيت الخامس: إبداع فني وخيالي. علاقات حب رومانسية مثالية أو حالمة.",
      "6": "نبتون في البيت السادس: عمل مرتبط بالخدمة أو الرعاية أو الفن. صحة غامضة أو تتأثر بالبيئة.",
      "7": "نبتون في البيت السابع: شراكات وزواج حالم أو مثالي. الشريك قد يكون غامضاً أو يحتاج إلى المساعدة.",
      "8": "نبتون في البيت الثامن: اهتمام بالأمور الروحانية والغموض. ضبابية في الموارد المشتركة أو الديون.",
      "9": "نبتون في البيت التاسع: رؤى فلسفية وروحانية. سفر مرتبط بالبحث عن المعنى أو التضحية.",
      "10": "نبتون في البيت العاشر: مسار مهني مرتبط بالفن، الرعاية، أو الروحانية. قد يكون الهدف المهني غير واضح.",
      "11": "نبتون في البيت الحادي عشر: صداقات مرتبطة بالفن أو الروحانية. ضبابية في الأهداف الجماعية أو الآمال.",
      "12": "نبتون في البيت الثاني عشر (حكمه الطبيعي): الروحانية، التعاطف، والخدمة الخفية. قوة في الأحلام واللاوعي."
    }
  },
  "pluto": {
    "signs": {
      "aries": "بلوتو في الحمل: جيل يتميز بالتحول الجذري في مفهوم الذات. قوة إرادة وميل للسيطرة على الهوية.",
      "taurus": "بلوتو في الثور: جيل يتميز بالتحول في الاقتصاد والموارد. رغبة في السيطرة على الثروة.",
      "gemini": "بلوتو في الجوزاء: جيل يتميز بالتحول في التواصل والمعلومات. قوة في الكلمات والتأثير.",
      "cancer": "بلوتو في السرطان: جيل يتميز بالتحول في مفهوم الأسرة والجذور. تجارب عميقة في الماضي العائلي.",
      "leo": "بلوتو في الأسد: جيل يتميز بالتحول في الإبداع والقيادة. قوة وسيطرة في التعبير عن الذات.",
      "virgo": "بلوتو في العذراء: جيل يتميز بالتحول في العمل والخدمة. رغبة في السيطرة على التفاصيل والروتين.",
      "libra": "بلوتو في الميزان: جيل يتميز بالتحول في العلاقات والعدالة. تجارب عميقة في الشراكات.",
      "scorpio": "بلوتو في العقرب (حكمه): جيل يتميز بالتحول الجذري والأسرار. قوة إرادة هائلة ورغبة في السيطرة والعمق.",
      "sagittarius": "بلوتو في القوس: جيل يتميز بالتحول في الفلسفة والمعتقدات. رغبة في السيطرة على الحقيقة.",
      "capricorn": "بلوتو في الجدي: جيل يتميز بالتحول في الهياكل والسلطة. رغبة في السيطرة على المؤسسات والمهنة.",
      "aquarius": "بلوتو في الدلو: جيل يتميز بالتحول في الأهداف والمجموعات. رغبة في السيطرة على الأفكار الإنسانية.",
      "pisces": "بلوتو في الحوت: جيل يتميز بالتحول في الروحانية واللاوعي. قوة في التطهير الروحي والتضحية."
    },
    "houses": {
      "1": "بلوتو في البيت الأول: شخصية مكثفة، قوية، ورغبة في السيطرة على البيئة المحيطة. تحول جذري في المظهر والهوية.",
      "2": "بلوتو في البيت الثاني: رغبة قوية أو هوس بالسيطرة على المال والموارد. تجارب تحويلية في الشؤون المالية.",
      "3": "بلوتو في البيت الثالث: قوة في الكلمات والتأثير على الآخرين. رغبة في السيطرة على التواصل والأشقاء.",
      "4": "بلوتو في البيت الرابع: تجارب عميقة وتحويلية في المنزل والعائلة. أسرار عائلية أو رغبة في السيطرة على الجذور.",
      "5": "بلوتو في البيت الخامس: شغف عميق في الإبداع والحب. علاقات حب تحويلية. رغبة في السيطرة على الأطفال.",
      "6": "بلوتو في البيت السادس: رغبة في السيطرة على بيئة العمل والصحة. تحول جذري في الروتين أو طرق الخدمة.",
      "7": "بلوتو في البيت السابع: شراكات وزواج يمر بتحولات عميقة وقوية. الشريك قد يمثل تحدياً أو قوة مسيطرة.",
      "8": "بلوتو في البيت الثامن (حكمه الطبيعي): قوة إرادة هائلة. تحول جذري في الحياة. اهتمام بالأسرار والموارد المشتركة.",
      "9": "بلوتو في البيت التاسع: رغبة في السيطرة على المعرفة والفلسفة. تجارب تحويلية من خلال السفر أو التعليم العالي.",
      "10": "بلوتو في البيت العاشر: رغبة قوية في السيطرة والنجاح المهني. تحول جذري في المسار المهني والمكانة.",
      "11": "بلوتو في البيت الحادي عشر: رغبة في السيطرة ضمن المجموعات أو على الأصدقاء. تجارب تحويلية في الأهداف المستقبلية.",
      "12": "بلوتو في البيت الثاني عشر: تحول جذري في اللاوعي والأسرار. قوة في التطهير الروحي والتعامل مع الخفاء."
    }
  },
  "rahu": {
    "signs": {
      "aries": "راهو في الحمل: الحاجة الكارمية للبدء، المبادرة، والتعبير عن الذات بقوة. هدف روحي موجه نحو الاستقلالية.",
      "taurus": "راهو في الثور: الحاجة الكارمية لبناء الثروة المادية، الجمال، وتثمين الذات. هوس بالاستقرار المالي.",
      "gemini": "راهو في الجوزاء: الحاجة الكارمية للتواصل، التنوع، واكتساب المعرفة. هوس بالمعلومات والشبكات.",
      "cancer": "راهو في السرطان: الحاجة الكارمية للأمان العاطفي، بناء عائلة، والتعلق بالجذور. هدف روحي موجه نحو الرعاية.",
      "leo": "راهو في الأسد: الحاجة الكارمية للقيادة، الإبداع، والاعتراف العام. هوس بالظهور والفخر.",
      "virgo": "راهو في العذراء: الحاجة الكارمية للنظام، التحليل، والخدمة. هوس بالتفاصيل وتحسين الذات والصحة.",
      "libra": "راهو في الميزان: الحاجة الكارمية للشراكة، التوازن، والدبلوماسية. هدف روحي موجه نحو إرضاء الآخرين.",
      "scorpio": "راهو في العقرب: الحاجة الكارمية للتحول، البحث، والتعامل مع الأسرار. هوس بالعمق والسيطرة على الشغف.",
      "sagittarius": "راهو في القوس: الحاجة الكارمية للمعرفة العالية، الفلسفة، والسفر البعيد. هوس بالسعي وراء الحقيقة.",
      "capricorn": "راهو في الجدي: الحاجة الكارمية للطموح، المكانة، والبنية الاجتماعية. هوس بالنجاح والعمل.",
      "aquarius": "راهو في الدلو: الحاجة الكارمية للابتكار، المجموعات، والحرية الفكرية. هدف روحي موجه نحو المستقبل.",
      "pisces": "راهو في الحوت: الحاجة الكارمية للروحانية، التعاطف، والتضحية. هوس بالخيال والبحث عن المعنى المطلق."
    },
    "houses": {
      "1": "راهو في البيت الأول: هوس بالهوية والمظهر الخارجي. هدف روحي لتطوير الذات في هذه الحياة.",
      "2": "راهو في البيت الثاني: هوس بكسب المال والممتلكات. تحديات كارمية متعلقة بالقيم أو الكلام.",
      "3": "راهو في البيت الثالث: رغبة قوية في التواصل والسفر القريب. تحديات في العلاقة مع الأشقاء أو الجيران.",
      "4": "راهو في البيت الرابع: هوس بالمنزل، الراحة، وبناء أساس عائلي. قد يسبب تقلباً في مكان الإقامة.",
      "5": "راهو في البيت الخامس: هوس بالإبداع، الحب، والمضاربة. تحديات أو رغبة قوية تجاه الأطفال.",
      "6": "راهو في البيت السادس: هوس بالعمل، الخدمة، أو مواجهة الأعداء. قد يسبب أمراضاً غامضة أو تحديات في الروتين.",
      "7": "راهو في البيت السابع: هوس بالشراكة والزواج. البحث عن شريك غير تقليدي أو أجنبي. محور الحياة هو الآخر.",
      "8": "راهو في البيت الثامن: هوس بالغموض، الأسرار، والموارد المشتركة. تحديات أو مكاسب غير متوقعة من الميراث.",
      "9": "راهو في البيت التاسع: هوس بالمعرفة البعيدة، السفر، والفلسفة. البحث عن معلم أو عقيدة خارجة عن المألوف.",
      "10": "راهو في البيت العاشر: هوس بالنجاح المهني والشهرة. تحقيق مكانة اجتماعية بطرق غير تقليدية.",
      "11": "راهو في البيت الحادي عشر: هوس بالأصدقاء والمجموعات. تحقيق الأهداف والأمنيات من خلال شبكات واسعة.",
      "12": "راهو في البيت الثاني عشر: هوس بالروحانية، العزلة، أو الأماكن البعيدة. تحديات في الخفاء واللاوعي."
    }
  },
  "ketu": {
    "signs": {
      "aries": "كيتو في الحمل: شعور بالانفصال أو الانتهاء من دروس المبادرة الذاتية. لا مبالاة بالتعبير عن الذات.",
      "taurus": "كيتو في الثور: لا مبالاة أو عدم اهتمام بالثروة المادية. صعوبة في تثمين الذات أو الممتلكات.",
      "gemini": "كيتو في الجوزاء: شعور بالانفصال عن التواصل اليومي. حكمة كارمية في مجال الأفكار.",
      "cancer": "كيتو في السرطان: شعور بالانفصال عن العائلة أو الأمان العاطفي. حكمة في التخلي عن التعلق بالجذور.",
      "leo": "كيتو في الأسد: شعور بعدم الارتياح تجاه القيادة أو الإبداع أو الظهور. حكمة في التواضع.",
      "virgo": "كيتو في العذراء: شعور بالإتقان الكارمي في الخدمة أو التحليل. قد يتجاهل التفاصيل أو الروتين.",
      "libra": "كيتو في الميزان: شعور بالانفصال عن الشراكات. يجد صعوبة في التناغم ويسعى للسلام الداخلي.",
      "scorpio": "كيتو في العقرب: شعور بالانفصال أو الانتهاء من دروس الأسرار والتحول. حكمة في الشغف.",
      "sagittarius": "كيتو في القوس: شعور بالإتقان الكارمي في المعرفة العالية. يبتعد عن المعتقدات التقليدية.",
      "capricorn": "كيتو في الجدي: شعور بالانفصال عن الطموح المهني. يجد حكمة في التخلي عن المكانة.",
      "aquarius": "كيتو في الدلو: شعور بالانفصال عن المجموعات والأصدقاء. حكمة في العمل الفردي أو الروحي.",
      "pisces": "كيتو في الحوت: شعور بالإتقان الكارمي في الروحانية. يجد صعوبة في التمييز بين الخيال والواقع."
    },
    "houses": {
      "1": "كيتو في البيت الأول: شعور بالانفصال عن الجسد أو الهوية. حكمة كارمية في الحياة الشخصية.",
      "2": "كيتو في البيت الثاني: لا مبالاة بالمال أو الممتلكات. حكمة في التخلي عن التعلق المادي.",
      "3": "كيتو في البيت الثالث: حكمة كارمية في التواصل. قد يتجنب العلاقات مع الأشقاء أو الجوار.",
      "4": "كيتو في البيت الرابع: لا مبالاة بالمنزل أو الجذور. حكمة في التخلي عن التعلق العاطفي بالأسرة.",
      "5": "كيتو في البيت الخامس: انفصال عن المتعة أو الإبداع. حكمة في التخلي عن التعلق بالأطفال أو الحب.",
      "6": "كيتو في البيت السادس: حكمة في مواجهة الأعداء والأمراض. لا مبالاة بالروتين اليومي أو الخدمة.",
      "7": "كيتو في البيت السابع: انفصال عن الشراكات أو الزواج. يجد السلام في العمل المنفرد.",
      "8": "كيتو في البيت الثامن: حكمة كارمية في التحول والأسرار. لا مبالاة بالموارد المشتركة.",
      "9": "كيتو في البيت التاسع: حكمة في الفلسفة. قد يتجنب السفر أو التعليم العالي. البحث عن الحقيقة داخلياً.",
      "10": "كيتو في البيت العاشر: انفصال عن المسار المهني أو الطموح. حكمة في التخلي عن المكانة الاجتماعية.",
      "11": "كيتو في البيت الحادي عشر: لا مبالاة بالأصدقاء أو المجموعات. حكمة في العمل لتحقيق الأهداف الروحية.",
      "12": "كيتو في البيت الثاني عشر (حكمه الطبيعي): حكمة في الروحانية والعزلة. قوة في التأمل والخدمة الخفية."
    }
  },
  "ascendant": {
    "aries": "الطالع في الحمل: يظهر الشخص للعالم كقائد، مبادر، وشجاع. سريع في الحركة والتعبير، وقد يميل إلى الاندفاع.",
    "taurus": "الطالع في الثور: المظهر الخارجي هادئ، ثابت، وحسي. يعطي انطباعاً بالقوة والعملية وحب الراحة.",
    "gemini": "الطالع في الجوزاء: يظهر الشخص فضولياً، متواصلاً، وسريع الحركة. التعبير متنوع والاهتمامات متعددة.",
    "cancer": "الطالع في السرطان: المظهر الخارجي حساس، متعاطف، وحذر. يعطي انطباعاً بالرعاية والارتباط بالماضي.",
    "leo": "الطالع في الأسد: يظهر الشخص واثقاً، درامياً، وكريماً. حضور لافت، يسعى لترك انطباع قوي وقيادي.",
    "virgo": "الطالع في العذراء: المظهر الخارجي مرتب، محجوز، ويهتم بالتفاصيل. يعطي انطباعاً بالخدمة والتحليل.",
    "libra": "الطالع في الميزان: يظهر الشخص ساحراً، دبلوماسياً، ويسعى للانسجام. يبحث عن التوازن في كل تفاعلاته.",
    "scorpio": "الطالع في العقرب: المظهر الخارجي مكثف، متحفظ، وغامض. يترك انطباعاً بالقوة والعمق والسيطرة.",
    "sagittarius": "الطالع في القوس: يظهر الشخص متفائلاً، مغامراً، وفلسفياً. لديه حاجة للحرية والتعبير الواسع.",
    "capricorn": "الطالع في الجدي: المظهر الخارجي جدي، مسؤول، ومنضبط. يعطي انطباعاً بالعملية والطموح المهني.",
    "aquarius": "الطالع في الدلو: يظهر الشخص مبتكراً، غير تقليدي، وإنسانياً. يترك انطباعاً بالفرادة والاهتمام بالمجموعات.",
    "pisces": "الطالع في الحوت: المظهر الخارجي حالم، متعاطف، وغامض. يبدو حساساً ويتأثر بالبيئة المحيطة."
  }
}